#include <iostream>

int main()
{
  int tableware[4][12] = {{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, //вилки
                          {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, //ложки
                          {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, //ножи
                          {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1}}; //десертные ложки

  int dishes[3][12] = {{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, //первое
                      {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, //второе
                      {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1}}; //десерт

  int chairs[12] = {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1};

  chairs[4] += 1;
  tableware[1][8] -= 1;
  tableware[1][5] -= 1;
  tableware[1][8] += 1;
  dishes[2][5] -= 1;
}